#-------------------------------------------------------------------------------
# Name:        考拉兹猜想,奇偶归一猜想
#练习重点:     嵌套
# Created:     27/04/2018
#coding:       utf-8
#-----------------------------------------------------------------------
times = 0
a = int(raw_input('number:'))
while a != 1:
    if a % 2 == 0:                  #若a为偶数
        a = a / 2
        if a == 0:
            print u'number 不能为0'
            break                   #防止a=0陷入死循环
    else:                           #若a为奇数
        a = a * 3 + 1
    print a                         #打印每次计算结果
    times += 1                      #统计计算次数
print "times:",times